app/Views/auth/dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `materials`
WHERE `course_id` = '11'
---
                                                <?php
                                                // Get materials count for this course
                                                $materialModel = new \App\Models\MaterialModel();
                                                $materialsCount = $materialModel->where('course_id', $course['id'])->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `materials`
WHERE `course_id` = '11'
---
                        foreach ($enrolledCourses as $course) {
                            if (is_array($course) && isset($course['id'])) {
                                $materialModel = new \App\Models\MaterialModel();
                                $materialsCount = $materialModel->where('course_id', $course['id'])->countAllResults();