app/Controllers/Admin/Courses.php

SELECT `c`.*, `u`.`name` as `teacher_name`, `u`.`email` as `teacher_email`
FROM `courses` `c`
LEFT JOIN `users` `u` ON `u`.`id` = `c`.`teacher_id`
WHERE `c`.`id` = '4'
---
    public function show($id = null)
    {
        // Admin only
        $this->requireRole('admin');

        $db = \Config\Database::connect();
        $course = $db->table('courses c')
            ->select('c.*, u.name as teacher_name, u.email as teacher_email')
            ->join('users u', 'u.id = c.teacher_id', 'left')
            ->where('c.id', $id)
            ->get()
            ->getRowArray();

SELECT `c`.`id`, `c`.`course`, `c`.`description`, `c`.`created_at`, `u`.`name` as `teacher_name`, `u`.`id` as `teacher_id`
FROM `courses` `c`
LEFT JOIN `users` `u` ON `u`.`id` = `c`.`teacher_id`
ORDER BY `c`.`created_at` DESC
---
    public function index()
    {
        // Admin only
        $this->requireRole('admin');

        $db = \Config\Database::connect();
        $courses = $db->table('courses c')
            ->select('c.id, c.course, c.description, c.created_at, u.name as teacher_name, u.id as teacher_id')
            ->join('users u', 'u.id = c.teacher_id', 'left')
            ->orderBy('c.created_at', 'DESC')
            ->get()
            ->getResultArray();

INSERT INTO `courses` (`course`, `description`, `teacher_id`, `created_at`, `updated_at`) VALUES ('SYSTEMS ANALYSIS AND DESIGN', 'PD312', 3, '2025-10-11 03:48:07', '2025-10-11 03:48:07')
---
        $courseModel = new CourseModel();

        try {
            $courseModel->save([
                'course' => $data['course'],
                'description' => !empty($data['description']) ? $data['description'] : null,
                'teacher_id' => $data['teacher_id']
            ]);