app/Controllers/Admin/Users.php

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function index()
    {
        $users = $this->userModel->orderBy('id', 'DESC')->findAll();

DELETE FROM `users`
WHERE `id` IN ('5')
---
    public function delete($id)
    {
        $this->userModel->delete($id);