app/Controllers/Auth.php


                // Check if user exists
                $builder = $db->table('users');
                $user = $builder->where('email', $email)
                              ->get()
                              ->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'mirai@gmail.com'

    public function dashboard()
    {
        // Check if user is logged in
        if (!$this->isLoggedIn()) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();
        $userId = session()->get('userID');
        $userRole = session()->get('role');

        // Initialize available and enrolled courses arrays
        $availableCourses = [];
        $enrolledCourses = [];

        // Only fetch courses for students
        if ($userRole === 'student') {
            try {
                // First, get all courses with teacher names
                $allCourses = $db->table('courses')
                    ->select('courses.id, courses.course, courses.description, courses.teacher_id, courses.created_at, courses.updated_at, users.name as teacher_name')
                    ->join('users', 'users.id = courses.teacher_id', 'left')
                    ->get()
                    ->getResultArray();

                // Get enrolled course IDs for the current student
                $enrolledCourseIds = [];
                $enrollmentCheck = $db->table('enrollments')
                    ->select('enrollments.course_id')
                    ->where('enrollments.student_id', $userId)
                    ->get();
---
SELECT `courses`.`id`, `courses`.`course`, `courses`.`description`, `courses`.`teacher_id`, `courses`.`created_at`, `courses`.`updated_at`, `users`.`name` as `teacher_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
SELECT `enrollments`.`course_id`
FROM `enrollments`
WHERE `enrollments`.`student_id` = '4'

        } elseif ($userRole === 'teacher') {
            try {
                // Get courses where this teacher is assigned
                $teacherCourses = $db->table('courses')
                    ->select('courses.*, users.name as teacher_name')
                    ->join('users', 'users.id = courses.teacher_id', 'left')
                    ->where('courses.teacher_id', $userId)
                    ->get()
                    ->getResultArray();
---
SELECT `courses`.*, `users`.`name` as `teacher_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
WHERE `courses`.`teacher_id` = '6'