app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'JeraldMaca@gmail.com'
---

                // Check if user exists
                $builder = $db->table('users');
                $user = $builder->where('email', $email)
                              ->get()
                              ->getRowArray();