app/Controllers/Course.php

        log_message('debug', 'Database connection established');

        // Verify course exists and is active
        $course = $db->table('courses')
            ->select('id, title, description')
            ->where('id', $courseId)
            ->get()
            ->getRowArray();
---
SELECT `id`, `title`, `description`
FROM `courses`
WHERE `id` = 2

            // Direct database insertion for debugging
            $db = \Config\Database::connect();
            $builder = $db->table('enrollments');
            $builder->insert($enrollmentData);
---
INSERT INTO `enrollments` (`student_id`, `course_id`, `enrolled_at`) VALUES (2, 2, '2025-10-10 01:28:40')