app/Controllers/Notifications.php

SELECT *
FROM `notifications`
WHERE `id` = '5'
AND `user_id` = '2'
 LIMIT 1
---
    public function mark_as_read($id = null)
    {
        if (!$this->isLoggedIn()) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Unauthorized'
            ])->setStatusCode(ResponseInterface::HTTP_UNAUTHORIZED);
        }

        if (!$id) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Notification ID is required'
            ])->setStatusCode(ResponseInterface::HTTP_BAD_REQUEST);
        }

        $userId = $this->userData['id'];

        // Check if notification belongs to the user
        $notification = $this->notificationModel->where('id', $id)
                                               ->where('user_id', $userId)
                                               ->first();