app/Models/EnrollmentModel.php

SELECT `courses`.`id`, `courses`.`course`, `courses`.`description`, `courses`.`teacher_id`, `courses`.`created_at`, `courses`.`updated_at`, `users`.`name` as `teacher_name`, `enrollments`.`enrolled_at`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
WHERE `enrollments`.`student_id` = 2
ORDER BY `enrollments`.`enrolled_at` DESC
---
    public function getUserEnrollments(int $userId): array
    {
        $enrollments = $this->db->table($this->table)
            ->select('courses.id, courses.course, courses.description, courses.teacher_id, courses.created_at, courses.updated_at, users.name as teacher_name, enrollments.enrolled_at')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->join('users', 'users.id = courses.teacher_id', 'left')
            ->where('enrollments.student_id', $userId)
            ->orderBy('enrollments.enrolled_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `student_id` = 2
AND `course_id` = 2
---
    public function isAlreadyEnrolled(int $userId, int $courseId): bool
    {
        return (bool) $this->where([
            'student_id' => $userId,
            'course_id'  => $courseId,
        ])->countAllResults();