app/Models/NotificationModel.php

SELECT *
FROM `notifications`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getNotificationsForUser($userId, $limit = 5)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->find();

UPDATE `notifications` SET `is_read` = 1
WHERE `notifications`.`id` IN ('5')
---
    public function markAsRead($notificationId)
    {
        return $this->update($notificationId, ['is_read' => 1]);